#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-5QehXeWxNgn4BV4C

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
data.aws_iam_policy_document.imagebuilder_stage: Refreshing state... [id=1407615633]
data.aws_iam_policy_document.imagebuilder_prod: Refreshing state... [id=2377160203]
data.aws_iam_policy_document.vmimport_trust: Refreshing state... [id=4085548158]
aws_iam_user.imagebuilder_prod: Refreshing state... [id=imagebuilder-prod]
aws_iam_role_policy_attachment.vmimport_base: Refreshing state... [id=vmimport-20201116144836626900000001]
aws_iam_policy.vmimport_base: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_base]
aws_s3_bucket.imagebuilder_prod: Refreshing state... [id=imagebuilder-service-prod]
aws_iam_user.imagebuilder_stage: Refreshing state... [id=imagebuilder-stage]
aws_s3_bucket.imagebuilder_stage: Refreshing state... [id=imagebuilder-service-stage]
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
data.aws_iam_policy_document.vmimport_ec2: Refreshing state...
data.aws_iam_policy_document.vmimport_s3: Refreshing state...
aws_iam_role.vmimport: Refreshing state... [id=vmimport]
aws_iam_policy.imagebuilder_prod_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-prod-workers-s3]
aws_iam_policy.imagebuilder_stage_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-stage-workers-s3]
aws_iam_user_policy_attachment.imagebuilder_stage_s3: Refreshing state... [id=imagebuilder-stage-20201113204258227600000002]
aws_iam_user_policy_attachment.imagebuilder_prod_s3: Refreshing state... [id=imagebuilder-prod-20201113204258223300000001]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.vmimport_base will be destroyed
  - resource "aws_iam_policy" "vmimport_base" {
      - arn    = "arn:aws:iam::933752197999:policy/vmimport_base" -> null
      - id     = "arn:aws:iam::933752197999:policy/vmimport_base" -> null
      - name   = "vmimport_base" -> null
      - path   = "/" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::imagebuilder-stage/*",
                          - "arn:aws:s3:::imagebuilder-stage",
                          - "arn:aws:s3:::imagebuilder-prod/*",
                          - "arn:aws:s3:::imagebuilder-prod",
                        ]
                      - Sid      = "1"
                    },
                  - {
                      - Action   = [
                          - "ec2:RegisterImage",
                          - "ec2:ModifySnapshotAttribute",
                          - "ec2:Describe*",
                          - "ec2:CopySnapshot",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "2"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_iam_policy.vmimport_ec2 will be created
  + resource "aws_iam_policy" "vmimport_ec2" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "vmimport_ec2"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:RegisterImage",
                          + "ec2:ModifySnapshotAttribute",
                          + "ec2:Describe*",
                          + "ec2:CopySnapshot",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.vmimport_s3 will be created
  + resource "aws_iam_policy" "vmimport_s3" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "vmimport_s3"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::imagebuilder-stage/*",
                          + "arn:aws:s3:::imagebuilder-stage",
                          + "arn:aws:s3:::imagebuilder-prod/*",
                          + "arn:aws:s3:::imagebuilder-prod",
                        ]
                      + Sid      = "1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role_policy_attachment.vmimport_base will be destroyed
  - resource "aws_iam_role_policy_attachment" "vmimport_base" {
      - id         = "vmimport-20201116144836626900000001" -> null
      - policy_arn = "arn:aws:iam::933752197999:policy/vmimport_base" -> null
      - role       = "vmimport" -> null
    }

  # aws_iam_role_policy_attachment.vmimport_ec2 will be created
  + resource "aws_iam_role_policy_attachment" "vmimport_ec2" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "vmimport"
    }

  # aws_iam_role_policy_attachment.vmimport_s3 will be created
  + resource "aws_iam_role_policy_attachment" "vmimport_s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "vmimport"
    }

  # aws_iam_user_policy_attachment.imagebuilder_prod_vmimport will be created
  + resource "aws_iam_user_policy_attachment" "imagebuilder_prod_vmimport" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "imagebuilder-prod"
    }

  # aws_iam_user_policy_attachment.imagebuilder_stage_vmimport will be created
  + resource "aws_iam_user_policy_attachment" "imagebuilder_stage_vmimport" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "imagebuilder-stage"
    }

Plan: 6 to add, 0 to change, 2 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*